Fs = 8e3;                           % Частота дискретизації 8 КГц
t = 0:1 / Fs:1;                     % 1 секунда дискретних моментів часу
t = t';                             % Перетворення рядка в стовпчик
A = 8;                              % Амплітуда - 8 В
f0 = 4e2;                           % Частота - 400 Гц
phi = pi / 4;                       % Початкова  фаза - 45 град
s1 = A * cos(2 * pi * f0 * t + phi);    % Гармонічний сигнал
alpha = 1e3;                        % Швидкість затухання експоненти
s2 = exp(-alpha * t) .* s1;         % Затухаюча косинусоїда
 
subplot(3, 2, 1); plot(s1(1:100));
grid;
subplot(3, 2, 2); plot(s2(1:100));
grid;
subplot(3, 2, 3); stem(s1(1:100));
grid;
subplot(3, 2, 4); stem(s2(1:100));
grid;
subplot(3, 2, 5); stairs(s1(1:100));
grid;
subplot(3, 2, 6); stairs(s2(1:100));
grid;
