Fs = 8e3;               % Частота дискретизації 8 кГц
t = 0 : 1 / Fs : 1;     % 1 секунда дискретних моментів часу
t = t';                 % Претворення рядку в стовпчик
A = 2;                  % Амплітуда - 2 В
f0 = 1e3;               % Частота - 1 кГц
phi = pi / 4;           % Початкова фаза - 45 град
s1 = A * cos(2 * pi * f0 * t + phi);    % Гармонічний сигнал
alpha = 1e3;                            % Швидкість затухання експоненти
s2 = exp(-alpha * t) .* s1;             % Загасаюча синусоїда
subplot(2, 2, 1);
plot(s2(1 : 100))
subplot(2, 2, 2);
plot(s2(1 : 100), '.')
subplot(2, 2, 3);
stem(s2(1 : 100))
subplot(2, 2, 4);
stairs(s2(1 : 100))
