N = 8;                  % Число ненульових гармонік
t = -1 : 0.01 : 1;      % Вектор моментів часу
A = 1;                  % Амплітуда
T = 1;                  % Період
nh = (1 : N) * 2 - 1;   % Номери ненульових гармонік

% Обчислення рядків-гармонік
harmonics = cos(2 * pi * nh' * t / T);
Am = 2 / pi ./ nh;                  % Амплітуди гармонік
Am(2 : 2 : end)= -Am(2 : 2 : end);  % Чергування знаків
s1 = harmonics .* repmat(Am', 1, length(t));

% Формування рядків – часткових сум гармонік
s2 = cumsum(s1);

for k = 1 : N,
    subplot(4, 2, k);
    plot(t, s2(k, :))
end
