N = 16;                 % Число ненульових гармонік
t = -1 : 0.01 : 1;      % Вектор моментів часу
A = 1;                  % Амплітуда
T = 1;                  % Період
nh = (1 : N) * 2 - 1;   % Номери ненульових гармонік

% Обчислення рядків-гармонік
harmonics = cos(2 * pi * nh' * t / T);
Am = 8 * A / (pi .^ 2) ./ (nh .^ 2);   % Амплітуди гармонік
s1 = harmonics .* repmat(Am', 1, size(t, 2));

% Формування рядків – часткових сум гармонік
s2 = cumsum(s1);
for k = 1 : N,
    subplot(N / 2, 2, k);
    plot(t, s2(k, :))
end
